// num.c
// 函数：名称、参数列表、函数体、返回值
// 全局、局部
#include <stdio.h>
// const 标记常量，声明时初始化之后就不可以再赋值
const char n = 1;
// 赋值只能写在函数里面
int t;
// t = 40不能在外面赋值
int main()
{
    /*
    // char,short,int,long,long long
    // 类型 标识符（变量名）
    // 声明、初始化（声明的时候赋值就是初始化）、赋值
    char n1 = 100;       // 10,0~9
    char n2 = 0144;      // 8,0~7,一般8进制表示开头标0
    char n3 = 0x64;      // 16,0~9,A~F 一般十六进制用0x表示
    char n4 = 0b100110; // 2,01，二进制用0b表示
    int n5=100;
    printf("%d,%#o,%#b\n", n2);
    printf("%d\n", n1);
    printf("%d,%o,%#o\n", n2); // o表示8进制
    printf("%d,%x,%#x\n", n3); // x表示16进制
    printf("%d,%b,%#b\n", n4); // b表示2进制
    */
    //------------------------------

    // char——1byte——8bit 256个数
    // 无符号数：0~255
    // 有符号数：-128 ~ 127
    // 如果数据溢出了，例如最大溢出则变为最小，最小溢出变为最大
    char c1 = 127;
    char c2 = -128;
    unsigned char c3 = 255; // 表示无符号数

    printf("c=%d\n", c1);
    printf("c2=%d\n", c2);
    // short——2byt——16bit 65536
    return 0;
}
// 78
// 39 0
// 19 1
// 9 1
// 4 1
// 2 0
// 1 0
// 0 1

// 0b1001110

// 0.125
// 0.25 0
// 0.5 0
// 0.0 1

// 0.1
// 0.2 0
// 0.4 0
// 0.8 0
// 0.6 1
// 0.2 1
// 0.4 0
// 0.8 0
// 0.6 1

// 111
