// op.c
// 运算符
// 函数名，参数列表，函数体，返回值
#include <stdio.h>
// 宏定义
#define PI 3.14159265
// #define PI = 3.14159265      错误写法
// #define PI 3.14159265;       错误写法
#define DIV 32.0
#define FACTOR (5.0 / 9.0)

int main()
{

    //-----------------------------------输入
    // print scan
    printf("请输入一个三位数的整数：");
    int n;
    scanf("%d", &n);
    // 例如 n = 345
    //  模10除10法
    int n1, n10, n100;
    n1 = n % 10; // 5
    n /= 10;     // 34

    n10 = n % 10; // 4
    n /= 10;      // 3

    n100 = n % 10; // 3
    n /= 10;       // 0

    // int x,y,z;
    // char ch;
    // printf("#");
    // scanf("%d%d%d",&x,&y,&z);
    // //scanf("%d,%d,%d",&x,&y,&z);
    // printf("x=%d,y=%d,z=%d\n",x,y,z);
    /*
    // 提示用户输入华氏度，输出摄氏度
    // c = (f - 32 ) * 5 / 9
    double f; // 华氏度
    double c; // 摄氏度
    printf("请输入华氏度：");
    // 格式化读取
    //& 取地址符，获得变量 f 所在的内存地址
    //%d，%f，%lf,%o
    scanf("%lf", &f);
    printf("%f\n", f);

    // 避免神秘数字
    // 解决方法1. 常量 2.宏（常量、字符替换）
    // c = (f - 32) * 5.0 / 9;
    c = (f - DIV) * FACTOR;
    printf("华氏度：%06.2f\n摄氏度：%6.2f\n", f, c);
    // 使用%06.1f则是显示包括小数点只有6位，不足的用0补齐
*/

    //-----------------------------------算术运算
    /*
            // int a = 2 / 3;   // 0            0 00...000 32
            // float b = 2 / 3; // 0.000000     0 0000000 00..00 23

            // // 模运算（只能是整数之间进行运算）
            // printf("%d\n", 7 / 4);
            // printf("%d\n", 7 % 4);   // 取余3，而且如果是n%4,那么范围只能是0~3，可以用它来计数
            // printf("%d\n", -7 % 4);  // 负号在左边则结果为-3
            // printf("%d\n", 7 % -4);  // 在右边则是3
            // printf("%d\n", -7 % -4); // 也是-3

            // a = a + 3;
            // a += 3; // 复合赋值

            // // 计数器
            // a++;
            // ++a;
            // a = 4;
            // int b1 = a++; // 后缀自增：先赋值再自增
            // printf("a=%d,b1=%d\n", a, b1);

            // a = 4;
            // int b2 = ++a; // 前缀自增：先自增再赋值
            // printf("a=%d,b2=%d\n", a, b2);

            // int x = 1, y = 2;
            // int z = ++x + y++; // z = 4

            // x = 2;
            // z = ++x + x++; // 这个不同编译器结果会不同，未定义行为
            // printf("z=%d\n", z);
        */
    /*
        //------------------------------------

        // // 声明（空间分配）、赋值
        // int a, x;
        // a = 9;           // 9是字面量
        // a = 2 + 3;       // 2+3是表达式
        // a = sizeof(int); // 函数

        // x = a, a = 3; // 先算左边
        // printf("%d\n", x);
        // int b = a;
        */
    //--------------------------------------

    return 0;
}
