// op.c
//  关系运算、逻辑运算
//  三要素：函数名、参数列表、函数体、返回值类型
#include <stdio.h>
#include <stdbool.h>
int main()
{

    // 3 多路分支
    //-------------------------------
    // if (condition)
    // {
    //     /* code */
    // }
    // else if (condition)
    // {
    //     /* code */
    // }
    // else
    // {
    //     /* code */
    // }

    //-------------------------------

    // 2 两路分支
    //-------------------------------
    // printf("请输入三个整数：");
    // int x, y, z;
    // scanf("%d %d %d", &x, &y, &z);
    // int max;
    // if (x > y)
    // {
    //     if (x > z)
    //         max = x;
    //     else
    //         max = z;
    // }
    // else
    // {
    //     max = y > z
    //             ? y
    //             : z;
    // }
    // printf("最大值 %d \n", max);
    //------------------------------------
    // printf("请输入整数：");
    // int n, z;
    // scanf("%d", &n);
    // z = n % 2;
    // //%s 是string，%p 是 pointer
    // //三元运算 ? :
    // printf("%d 是 %s\n",n,n%2 == 0 ? "偶数":"奇数")
    //--------------------------------------

    // 1 使用if()
    //-------------------------------------
    // if (1 == n % 2)
    // {
    //     printf("%d 是奇数\n", n);
    // }
    // printf("over\n");
    //-------------------------------------
    // if (0 == z)
    // {
    //     printf("%d 是偶数\n", n);
    // }
    // else
    // {
    //     printf("%d 是奇数\n", n);
    // }
    //----------------------------
    /*
    //------------------------------
    // int a = 1;
    // int b = 2;
    // printf("%d\n", a == b);
    // printf("%d\n", a != b);
    // printf("%d\n", a >= b);
    // printf("%d\n", a > b);
    // printf("%d\n", a <= b);
    // printf("%d\n", a < b);

    // _Bool b1 = a > b;
    // bool b2 = a > b;
    // bool b3 = true;
    // bool b4 = false;
    //------------------------------
    */
    return 0;
}
